package com.william.operator;

public class Operator_Priority {
    public static void main(String[] args) {
        // 7. 运算符优先级
        /* 优先级记忆方法：单目乘除为关系，逻辑三目后赋值

        单目运算符:一次作用一个变量的运算符，又叫一元运算符
        单目：单目运算符+ –(正负数) ，++ –，！（逻辑非），~（按位取反）
        乘除：算数运算符：* / % + -
        为：位运算符：~（按位取反）<<(左移) >>(右移)，^（也可以位运算，二进制异或）
        关系：关系运算符：> < >= <= == !=
        逻辑：逻辑运算符（除！）&& || & | ^
        三目：条件运算符A > B ? X : Y
        后：无意义，仅仅为了凑字数
        赋值：= += -= *= /= %= |= &= ^=

        ()
        ! -(负) ++ --
        * / %
        + -
        << >> >>>
        < <= > >= instanceof
        == !=
        &
        ^
        |
        &&
        ||
        ?:
        = += -= *= /= %= %=
        */

        // && 优先级高于 ||
        System.out.println(10 > 3 || 10 > 3 && 10 < 3); // true

        System.out.println( (10 > 3 || 10 > 3) && 10 < 3); // false

    }
}
